Revit 2026 API

# ApplicationNewProjectTemplateDocument Method

---

New project template document

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Document NewProjectTemplateDocument(
	string templateFilename
)
```
```vb
Public Overridable Function NewProjectTemplateDocument (
	templateFilename As String
) As Document
```
```cpp
public:
virtual Document^ NewProjectTemplateDocument(
	String^ templateFilename
)
```
```fsharp
abstract NewProjectTemplateDocument :
        templateFilename : string -> Document
override NewProjectTemplateDocument :
        templateFilename : string -> Document
```

#### Parameters

templateFilename String
    The template file name.

#### Return Value

Document

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'templateFileName' is  or an empty string. |
| InvalidOperationException | If the project template document cannot be created. |

This command corresponds to New->Project->Project Template command in the user-interface.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace